{"nodes":[{"x":-338.741455078125,"y":-23.444326400756836,"id":"Item# D107454-66, Date: 08-11-1957, Decade: 1950s, Address:","attributes":{"date":"8/11/57","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D107454-66","description":"Photographers gather and ready their cameras in a sepia picture taken on August 18, 1957.  Several of the men are wearing boutonnieres; they may be preparing to photograph the wedding of University of Washington graduates Luana Chizuru Uyeda and Dr. Keith Hiroshi Yoshino.  One man has an intricate 8 mm film camera with multiple flood lights.  A little boy, identified as Greg Mizukami,  appears to be starting his fascination with cameras with a small Brownie. Mr. Mizukami was nine years old in the picture and in 2007, still has an ongoing interest in photography. Photograph ordered by Luana Uyeda Yoshino.   (TNT 8-18-57, D-10)"},"color":"rgb(255,162,255)","size":12.5},{"x":274.98297119140625,"y":-33.838050842285156,"id":"Item# D153757-5, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","attributes":{"date":"12/20/68","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"773 BROADWAY, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D153757-5","description":"Thirty young Tacoma/Pierce County college-age debutantes were introduced to society at the third annual Red Rose Cotillion in December of 1968. The formal ball was held at the Winthrop Hotel under the auspices of the Unique Social \u0026 Community Club.  Dressed in white evening gowns and holding bouquets of American Beauty red roses, they smiled before the large gathering of proud family and friends.  Names of the 30 young collegians were listed in the News Tribune article dated December 22, 1968.  Betty Brown, daughter of Mr. and Mrs. Willie J. Brown, was chosen queen of the ball.  Photograph ordered by the Unique Social \u0026 Community Club.  (TNT 12-22-68, D-4)"},"color":"rgb(0,252,186)","size":10.0},{"x":-15.766646385192871,"y":132.06671142578125,"id":"2","attributes":{"Out-Degree":"6","In-Degree":"0","Modularity Class":"1","Degree":"6"},"color":"rgb(181,215,255)","size":10.833333015441895},{"x":507.38824462890625,"y":150.6237030029297,"id":"Item# W12-1, Date: 07-31-1936, Decade: 1930s, Address: 1406 54TH AVE E, FIFE","attributes":{"date":"7/31/36","Out-Degree":"0","decade":"1930s","In-Degree":"1","address":"1406 54TH AVE E, FIFE","Modularity Class":"4","Degree":"1","subject":"Native Americans","name":"W12-1","description":"On July 31, 1936, promoter Rookie Lewis outdid himself by staging an authentic \"Indian Wedding\" as the evening\u0027s special attraction during his Walkathon (dance marathon) at the Century Ballroom in Fife. Chief White Eagle conducted the Native American wedding of So-To-Le-O and groom Qua-Le-Ales, with rites performed in sign language. Five different tribes participated in the wedding. The Walkathon was heavily attended by citizens of Tacoma and Seattle, since both cities had local ordinances forbidding such marathons.  Approximately 30 people were pictured, first two rows were Native-Americans in costume, others may be some of the remaining participants in the Walkathon. Tribal blankets serve as backdrop.   (T.Times 7-31-36, p. 4-article; 8-1-36, p. 5-article; www.historylink.org) (filed with Argentum)"},"color":"rgb(97,250,34)","size":13.333333969116211},{"x":-179.20489501953125,"y":-15.003613471984863,"id":"Item# A96666-2, Date: 02-19-1956, Decade: 1950s, Address: 1717 FAWCETT AVE, TACOMA","attributes":{"date":"2/19/56","Out-Degree":"0","decade":"1950s","In-Degree":"1","address":"1717 FAWCETT AVE, TACOMA","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"A96666-2","description":"Three hundred participants in the ninth annual Northwest Young Buddhist League Convention posed for a group picture in front of the Tacoma Hongwanji Buddhist Church at 1717 Fawcett Avenue on February 19, 1956.  The three-day conference was coming to a close.  Seated in front row of the mostly Japanese-American gathering, wearing black robes and sashes, were nine Buddhist ministers including Sunya Pratt, the first woman to be ordained a Buddhist priest in the United States. The Tacoma Hongwanji Church had been established in 1915 and its present temple, still in operation, was built in 1930.  The temple is on the Tacoma City Register of historic buildings.  (Photograph ordered by the Tacoma Young Buddhist Association.)  TPL-3691"},"color":"rgb(255,162,255)","size":12.5},{"x":-296.79815673828125,"y":-220.32608032226562,"id":"Item# D161853-1, Date: 03-31-1972, Decade: 1970s, Address: 2413 E C ST, TACOMA","attributes":{"date":"3/31/72","Out-Degree":"0","decade":"1970s","In-Degree":"1","address":"2413 E C ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D161853-1","description":"Members of the Amaranth Court #9 are pictured above on March 31, 1972, at the Odd Fellows Hall, 2413 East C St.  Several of the women are wearing fezzes with tassels and decorated with a large star and name \"Deborah.\"  Photograph ordered by the Amaranth Court #9."},"color":"rgb(0,252,186)","size":10.0},{"x":531.7217407226562,"y":-76.67095184326172,"id":"Item# D153201-9, Date: 12-23-1967, Decade: 1960s, Address:","attributes":{"date":"12/23/67","Out-Degree":"0","decade":"1960s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D153201-9","description":"Tacoma\u0027s teenagers in action at the Hilltop Neighborhood Youth Activities Center,  S. 16th \u0026 \"K,\" December 23, 1967.  Several are dancing to the beat of a Masterwork radio while others watch.  In the right foreground is Brenda Middleton with James Wilkins at extreme right.  The center opened officially on December 4, 1967; its initial aim was to provide indoor recreation programs for young people.  Ten years later the Peoples Center would open at this location.  Photograph ordered by the Tacoma-Pierce County Opportunity \u0026 Development, Inc. (Additional identification provided by a reader)"},"color":"rgb(0,252,186)","size":10.0},{"x":-35.459228515625,"y":-252.89341735839844,"id":"Item# D162564-1, Date: 11-09-1972, Decade: 1970s, Address:","attributes":{"date":"11/9/72","Out-Degree":"0","decade":"1970s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D162564-1","description":"Nine members of the Unique Social \u0026 Community Club posed for a group studio portrait on November 9, 1972.  All the African-American women were dressed in dark evening gowns and white gloves.  For several years now the club had sponsored a glittering debutant ball in December where collegiate women made their introduction into society.  Photograph ordered by the Unique Social \u0026 Community Club."},"color":"rgb(0,252,186)","size":10.0},{"x":-357.10052490234375,"y":225.16490173339844,"id":"Item# A12970-2, Date: 06-18-1942, Decade: 1940s, Address: 47 SAINT HELENS AVE, TACOMA","attributes":{"date":"6/18/42","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"47 SAINT HELENS AVE, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"A12970-2","description":"Grand Officers of the Eastern Star on stage in June of 1942.  Flags of several nations, including the United States, and silhouettes of Presidents Lincoln and Washington serve as decorations.  1500 Eastern Star members attended the organization\u0027s 59th annual meeting held at the Masonic Temple.  Mayme Harmony was elected worthy grand matron and Irwin Jones, worthy grand patron.  (T.Times 6-17-42, p. 8-article; T.Times 6-19-42, p. 9-article)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-228.31544494628906,"y":95.05224609375,"id":"Item# 866-2, Date: 1949-07, Decade: 1940s, Address:","attributes":{"date":"1949-07","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"866-2","description":"Studio stock negatives. An aerial view of rural Pierce County with open and wooded areas. Small groupings of buildings are dotted over the area. Mount Rainier is seen above the mist."},"color":"rgb(255,162,255)","size":12.5},{"x":-228.57435607910156,"y":260.2346496582031,"id":"Item# A21726-1, Date: 03-22-1946, Decade: 1940s, Address: 737 41 SAINT HELENS AVE, TACOMA","attributes":{"date":"3/22/46","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"737 41 SAINT HELENS AVE, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"A21726-1","description":"The staff of the Progressive Italian-American Club stand behind the clubs newly modernized bar.  The PIA Club was about to celebrate their remodeling by hosting a complimentary buffet luncheon for fraternal and social members and the press. The club, at 739 St. Helens, had been totally remodeled, at a cost of over $70,000 - almost twice the original budget. Rocco Manza, the club manager, and Frank A. Reda, the social chairman, had made elaborate preparations for the event. The same location was later home to Honan\u0027s Restaurant.  (T. Times, 3/14/46, p. 9)."},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-565.2249755859375,"y":-79.81121826171875,"id":"Item# D46376-4, Date: 12-10-1949, Decade: 1940s, Address:","attributes":{"date":"12/10/49","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D46376-4","description":"On December 10, 1949, the patients at Madigan General Hospital consumed a huge mincemeat pie, measuring 42 inches across and weighing 150 lbs., at a \u0026quot;county fair\u0026quot; party put on by the hospital\u0027s Red Cross recreation staff. The Red Cross members who helped serve the pie were: (l - r), Mary Priebe,  Gloria Lynn, and Cass Shook. A plastic model of \u0026quot;Elsie\u0026quot;, the Borden Dairy mascot, sat at the head of the serving table. The event included contests such as nail driving, egg throwing (using ping pong balls) and hog calling. (TNT,12/17/1949, p.B-5)"},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":-117.58039855957031,"y":60.5343132019043,"id":"Item# D13064-2, Date: 07-09-1942, Decade: 1940s, Address:","attributes":{"date":"7/9/42","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D13064-2","description":"In July of 1942, eight members of the YWCA Girl Reserves answered the call for berry pickers in the Puyallup valley fields. The crop was rotting on the vine and there was a shortage of laborers.The girls lived at the Hesketh farm during the month of July and supported themselves by picking berries. Four of the young women were photographed sitting on a log by the river eating lunch. They are Janice Mechnik, Carolyn Lee, Marie Reynolds and Beverly Skaugset.Publicity for the Community Chest. (T. Times 7/16/1942, pg. 11)"},"color":"rgb(255,162,255)","size":12.5},{"x":446.1224060058594,"y":-116.04637908935547,"id":"Item# D145942-38RC, Date: 10-23-1965, Decade: 1960s, Address: 1411 YAKIMA AVE S, TACOMA","attributes":{"date":"10/23/65","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"1411 YAKIMA AVE S, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D145942-38RC","description":"Strickland-Taylor wedding.  The large wedding party poses for an October 23, 1965, formal group portrait in the Allen A.M.E. Church.  Joyce Wells and Terry Wells were the flower girls and Andre Croskey, the ringbearer.  The maid of honor, matron of honor and bridesmaids wore azalea-colored A-line gowns.  They were:  Dorothy Wells, Mrs. James Griffin, Margo Strickland, Wendy Strickland, Patricia Evans, Paulette Nunn and Ruby Nell.  The groom was assisted by his best man, his brother Michael Taylor, and six ushers:  Melvin Collins, Rodney Tanner, Joseph Murphy, James Griffin, John Asheley and Matthew Jones. Candlelighters were Brenda Wells and William Watkins.  Mamie Elizabeth Strickland wed Rev. Richard Edward Taylor in front of approximately 250-300 guests.  The couple planned to make their new home in Seattle.  (TNT 10-24-65, D-8)"},"color":"rgb(0,252,186)","size":10.0},{"x":246.9705352783203,"y":213.39321899414062,"id":"Item# A8045-2, Date: 04-22-1905, Decade: 1930s, Address: 1902-04 JEFFERSON AVE, TACOMA","attributes":{"date":"4/22/05","Out-Degree":"0","decade":"1930s","In-Degree":"1","address":"1902-04 JEFFERSON AVE, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"A8045-2","description":"ca. 1939. In 1939, members of the Tacoma Swiss Society celebrated their 50th Anniversary.   When the society was formed in 1889, there were about 200 Swiss living in and around Tacoma. The Swiss Society grew steadily and in 1913, Swiss Hall was built. Affiliate organizations formed like the Swiss Singing Society Edelweiss, shown here dressed in their native costumes. Other groups included: the Swiss Ladies Society, 1908; Swiss Wrestling Club; Swiss Aid Society, 1924; and, the Swiss Drill Team, a youth group organized in 1937.  (TNT, 4/26/1939, p. 26; T. Times 3/31/1939, pg. 11)."},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":294.86895751953125,"y":133.41903686523438,"id":"Item# D11917-1, Date: 09-20-1941, Decade: 1940s, Address:","attributes":{"date":"9/20/41","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"4","Degree":"1","subject":"Native Americans","name":"D11917-1","description":"In September of 1941, David Miller (far left) and Chief Jobe Charley (far right), the 81-year-old patriarch of the Yakima Nation\u0027s Great Council, came with their wives to the Federal court in Tacoma to plead the case for their treaty fishing rights. They came to argue that the Bonneville dam had backed up the waters of the Columbia River and its tributary, the White Salmon River, spoiling their \"usual and accustomed\" fishing grounds.  Mr. Miller\u0027s wife Bessie Charley-Miller is seated next to him.  (Additional identification provided by a family member)"},"color":"rgb(97,250,34)","size":13.333333969116211},{"x":123.68668365478516,"y":-5.697890281677246,"id":"Item# D30514-3, Date: 11-17-1947, Decade: 1940s, Address: 4360 N VERDE ST, TACOMA","attributes":{"date":"11/17/47","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"4360 N VERDE ST, TACOMA","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D30514-3","description":"Stepping out from the home of Florence Berry, these members of the Tahoma Guild, Tacoma Orthopedic Association, display large fund raising candles on November 17, 1947.  The Tahoma Guild would be distributing these \"Wishing Candles\" to many Tacoma restaurants. These candles were part of the Orthopedic Guild\u0027s efforts to raise money for disabled children and the future children\u0027s hospital. The candles would burn continuously, people wishing to donate money could make a wish then place the money in the wax. Co-chairmen for this project are Rose Weller and Hazel York (T. Times, 11/21/47, p. 15-different photograph). TPL-10581"},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":-251.90017700195312,"y":-107.6996078491211,"id":"Item# D156033-7, Date: 03-11-1969, Decade: 1960s, Address: 407 14TH AVE SE, PUYALLUP","attributes":{"date":"3/11/69","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"407 14TH AVE SE, PUYALLUP","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D156033-7","description":"Undergoing rehabilitation at Good Samaritan Hospital in March of 1969 is bearded Tacoma longshoreman Joseph E. Faker.  He is using a wheeled apparatus to help him stand.  Mr. Faker was injured in two separate Port of Tacoma accidents.  He would accept an out-of-court settlement minutes before trial began on February 2, 1970.  Mr. Faker allegedly sustained injuries on September 10, 1968, when a load of concrete asbestos pipe fell and crushed him as he was assisting in the discharge of cargo from the SS Trvovlje of the United Yugoslav Line.  He had previously been hurt in September of 1967 when he fell from a ladder while unloading salt on board the MV Argyll.  Photograph ordered by the law firm of Levinson Freidman, Seattle.  (TNT 2-5-70, p. 9 - article on settlement)"},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":-505.83367919921875,"y":-9.998311996459961,"id":"Item# D122125-2, Date: 07-14-1959, Decade: 1950s, Address:","attributes":{"date":"7/14/59","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D122125-2","description":"The Tacoma Buddhist Church at 1717 Fawcett Ave. held an O-bon Festival on Sunday, July 19, 1959. Dressed in kimonos with obis around their waists and zori sandals on their feet are (l to r) Carol Hayashi, Lynne Nakagawara, Laurie Tanabe, Kathy Tanabe, Atsuko Duchi and Joyce Nakagawara. The festival opened at 7 p.m. with a religious ceremonial dance. This was followed by a selection of colorful Japanese folk dances. Japanese paper lanterns were used as decoration, and Japanese flower arrangements by the women of the Buddhist Fujin-Kai were on display in the church basement. (TNT 7/17/1959, pg. 14) Picture ordered by the Tacoma Buddhist Church"},"color":"rgb(255,162,255)","size":12.5},{"x":401.928466796875,"y":-212.09573364257812,"id":"Item# D77667-1, Date: 09-10-1953, Decade: 1950s, Address:","attributes":{"date":"9/10/53","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D77667-1","description":"Chicago-Milwaukee railroad night train crew. The front row appears to be the staff for the dining room. In the back row are stewards, conductors and engineers. The railroad company began operating passenger and freight trains out of Tacoma in 1909. TPL-995"},"color":"rgb(0,252,186)","size":10.0},{"x":311.669189453125,"y":91.39012145996094,"id":"Item# A18416-1, Date: 10-26-1944, Decade: 1940s, Address: 773 BROADWAY, TACOMA","attributes":{"date":"10/26/44","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"773 BROADWAY, TACOMA","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"A18416-1","description":"Tacoma Credit Women were active members throughout the Tacoma community. They sponsored and hosted events for service men through the United Service Organization Travelers Aid Society. View of Tacoma Credit Women, members of the Tacoma Retail Credit Association."},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":579.8092041015625,"y":33.532066345214844,"id":"Item# D137328-3, Date: 01-20-1963, Decade: 1960s, Address: 773 BROADWAY, TACOMA","attributes":{"date":"1/20/63","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"773 BROADWAY, TACOMA","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D137328-3","description":"Lucille Larson was installed as president of the first Tacoma chapter of the American Business Women\u0027s Association at its charter meeting on Sunday, January 20, 1963.  The meeting was held in the Mayfair room of the Winthrop Hotel.   Sixteen women are pictured above with a small \"ABWA\" banner hung behind them.  (TNT 1-18-63, p. 13)"},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":-3.24686336517334,"y":-178.79286193847656,"id":"Item# D14126-1, Date: 02-28-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","attributes":{"date":"2/28/43","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"713-15 COMMERCE ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D14126-1","description":"Program coverage. U.S.O. Unit #2. A group of African American soldiers are sitting on stage looking out at the audience.  In the 1940\u0027s, the military service was still segregated and the USO club on Commerce St. was intended for servicemen of color.  [Also dated 02-29-1943] TPL-1958"},"color":"rgb(0,252,186)","size":10.0},{"x":451.2646789550781,"y":-38.45901107788086,"id":"Item# D155757-1, Date: 02-14-1969, Decade: 1960s, Address: 922 MARTIN LUTHER KING JR WAY, TACOMA","attributes":{"date":"2/14/69","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"922 MARTIN LUTHER KING JR WAY, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D155757-1","description":"Anticipation mounts just prior to the February 14, 1969, drawing for a new deluxe Volkswagen sponsored by the Central Area Progressive Improvement Association.   The little girl standing next to the automobile looks prepared to select the winning entry from the box before her.  Tickets were 3 for $1.00 or 50 cents apiece.  For a look at the winner, see D155757, image 3.  The people pictured above were not identified; they are presumably members of the Improvement Association.  Photograph ordered by the Central Area Progressive Improvement Association.  TPL-6681"},"color":"rgb(0,252,186)","size":10.0},{"x":-202.29896545410156,"y":-270.71295166015625,"id":"Item# D157803-3, Date: 01-23-1970, Decade: 1970s, Address: 1138 COMMERCE ST, TACOMA","attributes":{"date":"1/23/70","Out-Degree":"0","decade":"1970s","In-Degree":"1","address":"1138 COMMERCE ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D157803-3","description":"These three African American women are in the process of taking timed typing exams in the offices of the Tacoma-Pierce County Opportunity \u0026 Development, Inc., 1138 Commerce St., on January 23, 1970.  The O.D.I., an anti-poverty agency, sought to train and place the disadvantaged in various occupations. Photograph ordered by the Tacoma-Pierce County Opportunity \u0026 Development, Inc."},"color":"rgb(0,252,186)","size":10.0},{"x":189.4361572265625,"y":-205.1699676513672,"id":"Item# D53415-12, Date: 10-14-1950, Decade: 1950s, Address:","attributes":{"date":"10/14/50","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D53415-12","description":"Narrows Bridge Opening Ceremonies. An African American U.S. Army Band is standing at the ready in the foreground while a large crowd is listening to speakers on the grandstand at right. The new bridge\u0027s toll plaza is seen in the background. There were a total of six toll gates.  On opening day, $5547.40 was collected in tolls from those eager to travel on the new 5979 foot structure.  (TNT 10-16-50, p. 1)"},"color":"rgb(0,252,186)","size":10.0},{"x":283.2359619140625,"y":-146.33302307128906,"id":"Item# D631-2, Date: 12-10-1935, Decade: 1930s, Address:","attributes":{"date":"12/10/35","Out-Degree":"0","decade":"1930s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D631-2","description":"Charles H. Manley seated at a workbench looking at his collection of African weapons. Manley owned a tobacco store at 9th and Pacific for over 50 years. (T. Times)"},"color":"rgb(0,252,186)","size":10.0},{"x":-23.37146759033203,"y":-303.9091491699219,"id":"Item# D162110-7, Date: 07-07-1972, Decade: 1970s, Address:","attributes":{"date":"7/7/72","Out-Degree":"0","decade":"1970s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D162110-7","description":"This is believed to be Christine Powell or Powers who posed for a studio portrait on July 7, 1972.  A crinoline-like ruffle embraces her bare shoulders.  She resided at the Catalina Apartments, 1717 Yakima Ave. So."},"color":"rgb(0,252,186)","size":10.0},{"x":131.467529296875,"y":246.93434143066406,"id":"Item# A8319-3, Date: 06-22-1939, Decade: 1930s, Address:","attributes":{"date":"6/22/39","Out-Degree":"0","decade":"1930s","In-Degree":"1","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"A8319-3","description":"Lucia Rose Rigney O\u0027Donnell (left) and her twin sister Marcella Catherine Rigney Henly (right) were born to John and Elizabeth Rigney in 1862, two of 9 children and the second set of twins. John Rigney arrived in the Washington Territory in 1849 as a soldier assigned to Fort Steilacoom. He was born in Ireland, and had joined the army when he found it difficult to find work in New York. After his years in the army, he and his Irish born wife Elizabeth moved to a 640 acre donation land claim near So. 64th and Orchard. The family moved to Steilacoom in 1880, where the girls taught school and operated the area\u0027s first Western Union telegraph. As the twins became widows, they lived together at the Rigney home in Steilacoom and kept records for Western State Hospital until 1950. Marcella died in August of 1950 and Rose died March of 1951 after the pair celebrated their 89th birthday. (T. Times 6/22/1939, Section 2, p. 13)."},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-16.990264892578125,"y":132.03140258789062,"id":"1","attributes":{"Out-Degree":"27","In-Degree":"0","Modularity Class":"0","Degree":"27"},"color":"rgb(181,215,255)","size":10.0},{"x":-450.0888366699219,"y":-88.50894927978516,"id":"Item# D44664-6, Date: 08-25-1949, Decade: 1940s, Address:","attributes":{"date":"8/25/49","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D44664-6","description":"The United States was experiencing an increase in victims of infantile paralysis; it was believed that 1949 would have the most reported polio cases in history since 1916. The National Foundation for Infantile Paralysis was asking everyone to contribute in their special fund raising drive that was about to be launched. In January 1949, the March of Dimes had their annual fund raising drive. View of three children playing with cats, the little girl on the left side is wearing an orthopedic arm brace."},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":482.84051513671875,"y":-154.21263122558594,"id":"Item# D9128-1, Date: 1939-11, Decade: 1930s, Address: 530 BROADWAY, TACOMA","attributes":{"date":"1939-11","Out-Degree":"0","decade":"1930s","In-Degree":"1","address":"530 BROADWAY, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D9128-1","description":"University Union Club waiters. Seven African-American men dressed in waiters\u0027 uniforms posed for a group portrait in November of 1939."},"color":"rgb(0,252,186)","size":10.0},{"x":-337.2920227050781,"y":192.23780822753906,"id":"Item# D28082-3, Date: 05-29-1947, Decade: 1940s, Address: 405 BROADWAY, TACOMA","attributes":{"date":"5/29/47","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"405 BROADWAY, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"D28082-3","description":"Mrs. Marchell Sterns, Normanettes. The Normanette Women\u0027s Chorus Ensemble poses with their conductor and pianist. This was their fourth annual concert and was given at Weyerhaeuser Hall at the YWCA, May 29, 1947. One of their groups of songs was conprised of four songs, each in a different Scandinavian language. The rest of the program was sacred and classical music with some in a lighter vein. Names listed. (T.Times, 5/24/1947, p.12; 5/28/1947, p.4)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-33.40236282348633,"y":280.0916748046875,"id":"Item# C87485-22, Date: 03-22-1905, Decade: 1900s, Address: 2120 S C ST, TACOMA","attributes":{"date":"3/22/05","Out-Degree":"0","decade":"1900s","In-Degree":"1","address":"2120 S C ST, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"C87485-22","description":"ca. 1908. Emile Kliese, in a dark beard, and another man stand in the offices of Columbia Brewing Company by their tall desks. Emile Kliese was the German-born brewmaster who, with two other men, William C. Kiltz and John Smith, filled for articles of incorporation in 1900 \"to brew and sell at wholesale and retail beer and other malt beverages\" at a company to be known as \"the Columbia Brewing Company\". Emile Kliese was the first president and brewmaster of the Columbia Brewing Company from 1900 to 1916. Copies of old prints ordered by Heidelberg Brewing Company. (TNT, 10/6/1951, p.A-3)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":330.5523681640625,"y":50.329715728759766,"id":"Item# D30536-3, Date: 11-17-1947, Decade: 1940s, Address:","attributes":{"date":"11/17/47","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D30536-3","description":"Tacoma\u0027s Monday Civic Club was having their annual All-State banquet on November 17, 1947.  Washington State Supreme Court Judge Walter B. Beals would be the event\u0027s guest speaker. Tickets for the banquet are available through Fraser\u0027s and Ted Brown Music Company. Civic Club President, Georgiana Oursler will begin the celebration by welcoming everyone. View of Monday Civic Club members preparing for the big event (T. Times, 11/19/47, p. 13)."},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":-93.49932861328125,"y":-187.27200317382812,"id":"Item# D14126-4, Date: 03-02-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","attributes":{"date":"3/2/43","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"713-15 COMMERCE ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D14126-4","description":"Program coverage.  U.S.O. Unit #2. A group of women standing and seated. Lady seated in front on left has a badge stating: Senior Hostess, U.S.O., No.2, Tacoma. USO #2 was located at 713-15 Commerce St. and was intended for use by servicemen of color.  [Also dated 02-29-1943]"},"color":"rgb(0,252,186)","size":10.0},{"x":48.874881744384766,"y":-122.79878234863281,"id":"Item# D34348-4, Date: 07-20-1948, Decade: 1940s, Address: 719 COMMERCE ST, TACOMA","attributes":{"date":"7/20/48","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"719 COMMERCE ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D34348-4","description":"Raleigh Sligar was promoting and sponsoring a boxing event, the fight would be at the State Armory. View of boxer doing his promotional photos at Kelly\u0027s Gym, the boxer is ready for his upcoming fight."},"color":"rgb(0,252,186)","size":10.0},{"x":290.89471435546875,"y":-75.2480697631836,"id":"Item# D153256-8R, Date: 01-09-1968, Decade: 1960s, Address: 1407 S I ST, TACOMA","attributes":{"date":"1/9/68","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"1407 S I ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D153256-8R","description":"On January 9, 1968, official paperwork was signed at the Church of the Holy Communion, making the Church\u0027s parish house at 1407 So. I St. the home of the Hilltop Day Care Center. The Center started operation in mid-January, supplying needed child care to low-income parents. It was sponsored by the church and the Hilltop Multi-Service Center and operated Monday through Fridays. It had room for 37 children. The Episcopalian minister on the far right is Rev. E.O. Winckley, the pastor of the church. The woman in the middle of photograph wearing a broach is the director, Mrs. Janabea Gamell; the other woman is unidentified.  The man standing is Herman Walker, head of the Hilltop Multi-Service Center.  Photograph ordered by the Tacoma-Pierce County Opportunity \u0026 Development, Inc.  (TNT 12-27-67, A-5, TNT 1-13-68, p. 20)"},"color":"rgb(0,252,186)","size":10.0},{"x":-358.3764953613281,"y":-108.83509063720703,"id":"Item# D10217-14, Date: 09-09-1940, Decade: 1940s, Address: 3572 PACIFIC AVE, TACOMA","attributes":{"date":"9/9/40","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"3572 PACIFIC AVE, TACOMA","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D10217-14","description":"Polio patients encased in iron lungs at the Pierce County Hospital. The infectious viral disease affected children and young adults, sometimes causing paralysis. One of the most dreaded complications was the loss of the ability to breathe. The iron respirator took over that responsibility, breathing for the child."},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":538.5460205078125,"y":90.31285095214844,"id":"Item# D61698-3, Date: 10-22-1951, Decade: 1950s, Address: 3500 N 18TH ST, TACOMA","attributes":{"date":"10/22/51","Out-Degree":"0","decade":"1950s","In-Degree":"1","address":"3500 N 18TH ST, TACOMA","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D61698-3","description":"Lucille (Mrs. R. Franklin) Thompson, wife of the College of Puget Sound\u0027s president, opened her home to the Women\u0027s College League for their annual membership tea in October, 1951.  Standing left to right are Mrs. Frank Plum, Mrs. Thompson, Mrs. George Frank.  Seated are other tea committee members, Mrs. Sabin Swanson, Mrs. William L. Brown, president of the league, and Mrs. Charles Zittel.  The Thompsons resided in an English Tudor built in 1949 on the college campus.  (TNT 10-28-51, D-6)"},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":-38.18527603149414,"y":17.146570205688477,"id":"Item# D31335-4, Date: 01-07-1948, Decade: 1940s, Address: 734 PACIFIC AVE, TACOMA","attributes":{"date":"1/7/48","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"734 PACIFIC AVE, TACOMA","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D31335-4","description":"Julia Lee MacDonald was the Tacoma Times Society pages Editor-in-Chief, she had twin sons and was a widow. The Tacoma Times Society pages handled news, arts, events and pictures of women\u0027s activities. The newspaper stated, \"More Women\u0027s News - More Fashions - More Pictures - More Food News in your Tacoma Times\" They were known as \"Tacoma\u0027s Fastest Growing Progressive Newspaper\"  (T. Times, 1/17/48, p. 1)."},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":347.0711975097656,"y":-66.18263244628906,"id":"Item# D156024-4R, Date: 02-04-1969, Decade: 1960s, Address:","attributes":{"date":"2/4/69","Out-Degree":"0","decade":"1960s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D156024-4R","description":"The first applicant to be approved for a grant from the Hilltop Vocational Scholarship Fund, 8-year Army veteran Harold Pruitt (left), visited Hilltop Multi-Service director Herman Walker on February 4, 1969.  The grants are funded through a cooperation between private industry and various Tacoma churches and are administered by the Hilltop Multi-Service Center.  Mr. Pruitt is holding two books, one on business etiquette and the other, a Funk \u0026 Wagnalls dictionary.  Photograph ordered by the Tacoma-Pierce County Opportunity \u0026 Development, Inc.  (TNT 3-7-69, p. 24)"},"color":"rgb(0,252,186)","size":10.0},{"x":-284.2310791015625,"y":182.66993713378906,"id":"Item# A62012-2, Date: 11-05-1951, Decade: 1950s, Address: 5229 SOUTH TACOMA WAY, TACOMA","attributes":{"date":"11/5/51","Out-Degree":"0","decade":"1950s","In-Degree":"1","address":"5229 SOUTH TACOMA WAY, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"A62012-2","description":"South Tacoma\u0027s Main Yon Cafe had the grand opening of their new dining room in early November, 1951.  The Main Yon\u0027s new dining room had comfortable booth seating and was beautifully decorated with a Chinese themed wall mural.  Orchids for the ladies and ice cream and coffee were offered free during the grand opening.  Owned and operated by \"Charlie\" Eng Sing Poy, the Main Yon had been in business for 16 years.  Originally from Canton, China, Mr. Eng Sing Poy received his naturalization papers in October, 1951.  Photograph ordered by Udall Construction Company.  TPL-8120  (TNT 11-6-1951, p. 7)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-15.258750915527344,"y":131.1951446533203,"id":"5","attributes":{"Out-Degree":"3","In-Degree":"0","Modularity Class":"4","Degree":"3"},"color":"rgb(181,215,255)","size":13.333333969116211},{"x":-14.743833541870117,"y":131.0099639892578,"id":"6","attributes":{"Out-Degree":"9","In-Degree":"0","Modularity Class":"5","Degree":"9"},"color":"rgb(181,215,255)","size":14.166666030883789},{"x":-389.5802307128906,"y":9.34494400024414,"id":"Item# A109525-6, Date: 10-27-1957, Decade: 1950s, Address: 1901 S FAWCETT AVE, TACOMA","attributes":{"date":"10/27/57","Out-Degree":"0","decade":"1950s","In-Degree":"1","address":"1901 S FAWCETT AVE, TACOMA","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"A109525-6","description":"The Japanese Methodist Church celebrated its 50th anniversary October 25-57, 1957.  The congregation is amassed in front of the venerable church at South 19th and Fawcett.  One of the special guests on October 27, 1957, was the first minister of the (then) Tacoma Japanese Methodist Episcopal Church, the Rev. Seichi Higashida.  The building at 19th \u0026 Fawcett was started in 1929 and paid off in 1933.  Begun in 1907 as a mission society for Japanese immigrants, the church was to change its name to Whitney Memorial United Methodist Church in the 1960\u0027s.  It was to later close in 1999, due to declining attendance, and the property purchased by the University of Washington.  Photograph ordered by Kaz Yamane, Tacoma Japanese Methodist Church.  (TNT 10-26-57, p. 14)"},"color":"rgb(255,162,255)","size":12.5},{"x":162.3360137939453,"y":-285.47271728515625,"id":"Item# D168561-1, Date: 04-12-1978, Decade: 1970s, Address:","attributes":{"date":"4/12/78","Out-Degree":"0","decade":"1970s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D168561-1","description":"Studio portrait of Steve Garrett.  Mr. Garrett was the meat manager at the Villa Plaza Safeway in Lakewood.  He was named the Safeway \"Employee Courtesy Winner of the Month\" and this photograph used in a Safeway ad in the May 17, 1978, News Tribune.  According to the 1979 City Directory, he and wife Earlene resided at 1414 S. Ainsworth Ave.  Photograph ordered by Safeway.  (TNT 5-17-78, F-2)"},"color":"rgb(0,252,186)","size":10.0},{"x":-398.48052978515625,"y":-172.43788146972656,"id":"Item# D44621-2, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","attributes":{"date":"8/28/49","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"1723 S I ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D44621-2","description":"In August of 1949 the congregation of the Bethlehem Baptist Church of Tacoma  celebrated the 10th anniversary of Reverend Edward Byard Wilson, Pastor. The Bethlehem Baptist Church was dedicated in August 1922; the church building costs were about $10,000. This church is located at South 18th \u0026 I Street, in the Hilltop area of Tacoma. On January 7, 1959 the church was virtually destroyed by a fire, and it had to be rebuilt."},"color":"rgb(0,252,186)","size":10.0},{"x":-127.82917785644531,"y":-99.66139221191406,"id":"Item# D125214-2, Date: 02-04-1960, Decade: 1960s, Address:","attributes":{"date":"2/4/60","Out-Degree":"0","decade":"1960s","In-Degree":"1","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D125214-2","description":"Mayor Ben Hanson, in catcher\u0027s crouch, posed with Tacoma Giants general manager W.D. \"Rosy\" Ryan (wearing mitt) and officials of the Harmony Chapter #18, Disabled American Veterans, on February 4, 1960.  Ernie Roberts, Western Washington chief of staff for the DAV, was clutching a Mickey Mantle Louisville slugger.  Baseball memorabilia, including a Giants uniform, was on display in cases behind the men.  Mayor Hanson and Mr. Ryan pledged their support for the Disabled American Veterans convention coming to Tacoma in July of 1960, while Robert Stelzer and Loyd E. Ireland looked on.  Mr. Ryan also indicated that veterans would receive every consideration for jobs at the new Ben Cheney Stadium and concessions.  Photograph ordered by Ernie Roberts.  (TNT 2-8-60, p. 3)"},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":435.90093994140625,"y":27.780729293823242,"id":"Item# D30536-5, Date: 11-17-1947, Decade: 1940s, Address:","attributes":{"date":"11/17/47","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D30536-5","description":"In November of 1947, members of Tacoma\u0027s Monday Civic Club posed for the Richards Studio in costume at an unidentified location. They were publicizing their upcoming annual All State Banquet, scheduled for November 24th at the Fellowship Hall. One of the featured events was the \"Pageant of the States,\" written and directed by Tacoma\u0027s own historical author Della Gould Emmons. The skit depicted the history of the United States with the club members representing the 48 states and dressed in costumes typical of the time that the individual states entered the Union. Seated in the middle of the front row dressed in black was Mrs. Byron Moye, representing Montana. Standing row, second from left Mrs. Marcus Reeves, Oregon; eight from left Mrs. Myrtle Bowler, Idaho; to the right of Mrs. Bowler was Mrs. William Sechler, Washington; and further down in black western style hat Mrs. Frank Rybin, Wyoming. (T. Times, 11/19/47, p. 13- article, 11/22/47, pg. 10- alternate picture)."},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":81.76235961914062,"y":-42.781219482421875,"id":"Item# D153757-5RC, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","attributes":{"date":"12/20/68","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"773 BROADWAY, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D153757-5RC","description":"These elegantly dressed young men with their spotless white gloves were escorts for the 30 women making their debut into society at the Red Rose Cotillion on December 20, 1968.  The beautifully decorated room was the Crystal Ballroom in the Winthrop Hotel, 773 Broadway, scene of many formal balls and events.  The Unique Social \u0026 Community Club held this Christmas-time cotillion, dubbed the \"Red Rose\" since the debutantes all carried bouquets of long stem American Beauty red roses, to formally introduce the young women to society. Names of the escorts were listed in the News Tribune article dated December 22, 1968.  Color photograph ordered by the Unique Social \u0026 Community Club.  (TNT 12-22-68, D-4)"},"color":"rgb(0,252,186)","size":10.0},{"x":386.32733154296875,"y":-0.25729572772979736,"id":"Item# D12971-3, Date: 06-15-1942, Decade: 1940s, Address:","attributes":{"date":"6/15/42","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D12971-3","description":"Dorothy Axtelle, in her first senior competition, had just claimed the title of Women\u0027s Division State Archery Champion. She was previously the Junior National title holder. She won four trophies in four events, shooting 33 points above her nearest competitor. (T. Times 6/16/1942, pg. 12)"},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":-115.74896240234375,"y":227.49798583984375,"id":"Item# D14382-3, Date: 04-16-1943, Decade: 1940s, Address: 1347 1/2 BROADWAY, TACOMA","attributes":{"date":"4/16/43","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"1347 1/2 BROADWAY, TACOMA","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"D14382-3","description":"Tacoma Mayor Harry Cain\u0027s crack down on gambling resulted in a second successful raid by the State Patrol on April 16, 1943. This time, it was the Good Luck Club at 1347 1/2 Broadway where  eleven Chinese people were arrested in connection with the illegal gambling raid. Over seventy customers had their names recorded as a curious crowd grew in front of The Kennel Tavern and The China Inn, but they were not detained. The gambling club was located on the second floor and was not connected with the first floor businesses. The State Patrol netted $1415.50, a locked safe and gambling paraphernalia. Public Safety Commissioner Einar Langseth called it a publicity stunt by the Mayor. On April 19, Mayor Cain demanded Langseth\u0027s resignation. He refused but was later brought up on impeachment charges. (T.Times, 4/17/1943, p.1; TNT 4/17/1943, pg 1)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":-250.4157257080078,"y":75.8491439819336,"id":"Item# D13060-1, Date: 07-03-1942, Decade: 1940s, Address:","attributes":{"date":"7/3/42","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D13060-1","description":"On Friday July 3rd, 1942, Tacoma Mayor Harry P. Cain and his wife Marjorie got up early to practice their berry picking skills in a neighbor\u0027s back yard. They were preparing spend the 4th of July weekend picking raspberries in the Puyallup Valley. The forced evacuation of Japanese-Americans in the spring led to a labor shortage in the fields and all local citizens were asked to help the war effort by volunteering on the Independence Day weekend to harvest the ripe raspberry crops. Mayor Cain suggested that Tacomans pack a lunch, make some lemonade, load up the kiddies and make the harvesting a family affair.  He stated that \"You couldn\u0027t possibly find a better way of living up to the true meaning of Fourth of July.  Let\u0027s all celebrate it that way.\"  (T. Times 7/3/1942, pg. 1)"},"color":"rgb(255,162,255)","size":12.5},{"x":409.2299499511719,"y":149.18276977539062,"id":"Item# G5.1-011, Date: 1933-02, Decade: 1930s, Address:","attributes":{"date":"1933-02","Out-Degree":"0","decade":"1930s","In-Degree":"1","Modularity Class":"4","Degree":"1","subject":"Native Americans","name":"G5.1-011","description":"In 1933, the Puyallup Tribe of Indians urged the federal government to purchase the outdated Tacoma Indian Hospital complex and build a new facility.  The Puyallup Tribal Council met with newly elected U.S. Representative Wesley Lloyd in February 1933 to seek his support.  After numerous delays, the new hospital was completed in 1943. Standing, left to right:  Silas Meeker (Tribal Secretary), Frank Wrolson, Representative  Lloyd.  Seated, left to right:  Benjamin Wright, William Davis, Silas Cross (Tribal Chairman), Dorothy Kellogg (assistant to Representative Lloyd). Frank Wrolson\u0027s last name was misspelled on the photograph."},"color":"rgb(97,250,34)","size":13.333333969116211},{"x":-276.9288024902344,"y":-163.9960479736328,"id":"Item# D44621-6, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","attributes":{"date":"8/28/49","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"1723 S I ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D44621-6","description":"Bethlehem Baptist Church was celebrating the 10th anniversary of their pastor, Reverend Edward Byard Wilson, in August of 1949.  View of Reverend Wilson, who is joined by his wife, Allie, friends, and other church members. TPL-5783"},"color":"rgb(0,252,186)","size":10.0},{"x":175.389404296875,"y":-132.4127197265625,"id":"Item# D14126-2, Date: 03-02-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","attributes":{"date":"3/2/43","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"713-15 COMMERCE ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D14126-2","description":"Program coverage.  U.S.O. Unit #2. A group of mostly service men are seated in the audience.  Other unidentified individuals are seated on the stage. In 1943, the Army was still segregated and the USO Club art 713-15 Commerce was intended for servicemen of color.  [Also dated 02-29-1943]"},"color":"rgb(0,252,186)","size":10.0},{"x":-15.061613082885742,"y":132.9681854248047,"id":"3","attributes":{"Out-Degree":"9","In-Degree":"0","Modularity Class":"2","Degree":"9"},"color":"rgb(181,215,255)","size":11.666666984558105},{"x":-487.7893981933594,"y":58.333343505859375,"id":"Item# A1955-1, Date: 04-10-1905, Decade: 1920s, Address:","attributes":{"date":"4/10/05","Out-Degree":"0","decade":"1920s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"A1955-1","description":"ca. 1927. Americanization class at Tacoma Rescue Mission ca. 1927. Woman at organ leads Japanese children in song. The singing children wave flags and wear paper caps.  Man at rear behind pulpit with embroidered cloth marked \"Jesus\" was pictured in A1956-1 reading to the children. (filed with Argentum)"},"color":"rgb(255,162,255)","size":12.5},{"x":29.638629913330078,"y":-237.08685302734375,"id":"Item# D91099-1, Date: 06-06-1955, Decade: 1950s, Address:","attributes":{"date":"6/6/55","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D91099-1","description":"In June of 1955, while a member of the Washington Cheney Studs, Luther Carr demonstrated his bunting technique for the camera.  Luther Carr played for Lincoln High School and had aroused the interest of several major colleges and professional teams. He played baseball, football, basketball and competed in track. An all around athlete, Carr  in May of 1955 broke the state prep broadjump record that had stood since 1938. His jump was 23 feet, 9 5/8 inches. Carr turned down many professional sports offers after high school, choosing instead a college sports scholarship with the University of Washington Huskies. While a Husky, Luther scored on some of the most dazzling runs ever seen in Husky Stadium. The Studs, an amateur team made up of the most talented baseball players in the Puget Sound area, played 60 games during the summer of 1955 including several against professional players.  (TNT 5/1/1955, pg. B-14)"},"color":"rgb(0,252,186)","size":10.0},{"x":-375.16680908203125,"y":-55.9674072265625,"id":"Item# D77145-3, Date: 11-22-1953, Decade: 1950s, Address:","attributes":{"date":"11/22/53","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"1","Degree":"1","subject":"Disabled Americans","name":"D77145-3","description":"Disabled American Veterans, Tacoma Chapter 1, fund raising committee members. The Disabled American Veterans Hospital and Rehabilitation Fund Drive Committee working on the distribution of DAV sticker seals. The seals were sent in the mail for sale. Proceeds from the sale of the seals was used to further the DAV\u0027s work in providing gifts, entertainment and personal needs to patients in veterans\u0027 hospitals and soldiers\u0027 homes. Committee members are, left to right, M.J. Warden, W.E. Black, H.L. McLaughlin, Buster R. Gallatin and Fred A. Tegard. (TNT 11/29/1953, pg. A-14)"},"color":"rgb(0,253,255)","size":10.833333015441895},{"x":-459.151123046875,"y":100.92208099365234,"id":"Item# D8869-85, Date: 04-22-1905, Decade: 1930s, Address: 5700 20TH ST E, TACOMA","attributes":{"date":"4/22/05","Out-Degree":"0","decade":"1930s","In-Degree":"1","address":"5700 20TH ST E, TACOMA","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D8869-85","description":"ca. 1939. Group portrait of Fife High School football team, the Trojans. Coach Bill Vinson at far right rear. Player number 10 is Frank Spear, cited by the Tacoma Times as a player of the week. Half of the team is made up of Japanese-American players. Fife was having a very successful year, winning 9 straight games on their way to becoming the Pierce County B League Champions. They continued on to defeat the favored Poulsbo Vikings 7-0 to become the State Champions. Although the Trojan linemen were much outweighed, in one case by over 40 pounds; they were faster and more agile than their opponents. (T. Times 11/16/1939, pg. 19; 11/18/1939, pg. 13)"},"color":"rgb(255,162,255)","size":12.5},{"x":-278.9631652832031,"y":42.956905364990234,"id":"Item# D12299-11, Date: 12-12-1941, Decade: 1940s, Address:","attributes":{"date":"12/12/41","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D12299-11","description":"Eleanor Roosevelt, as assistant director of the Office of Civilian Defense, came to Tacoma Saturday morning December 13, 1941 to meet with local civilian defense chiefs in Mayor Harry P. Cain\u0027s office. Mayor Cain arranged a meeting between Mrs. Roosevelt and a delegation of local, young,  American-born Japanese who represented the Japanese American Joint Defense Corps. The delegation included (from l to r) Shigeko Tamaki, Shigeo Wakamatsu, Waichi Oyanagi, and Ted Nakamura. In her remarks to the defense chiefs she had said, \" Give American born Japanese, and even Japanese nationals who lived in this country for years, who have children and grand children and who have bought defense bonds - give them every consideration.\"  TPL-7964"},"color":"rgb(255,162,255)","size":12.5},{"x":126.11003875732422,"y":23.419464111328125,"id":"Item# D10441-3, Date: 11-15-1940, Decade: 1940s, Address:","attributes":{"date":"11/15/40","Out-Degree":"0","decade":"1940s","In-Degree":"1","Modularity Class":"5","Degree":"1","subject":"Women\u0027s Rights","name":"D10441-3","description":"Jan Peterson, lively stenographer at Gagliardi\u0027s office, is one of 90 members of Tacoma\u0027s newly organized National Service League. The League instructs women how to lend assistance in case of emergency and support the Home Defense Corps. The group is drilled twice a week by drill sergeants from Fort Lewis, who also instruct them in signalling and First Aid. The women also receive instruction in marksmanship and radio communications. Miss Peterson said that she liked the \"glamour\" of it all but when questioned about the dirt and grease of the required auto mechanics, she agreed that it was part of the job to get dirty and she didn\u0027t mind it at all. By February of 1941, the National Service League was declared a hoax by the Better Business Bureau. It existed to fleece women on the sale of \"required\" uniforms. The Tacoma branch split from the parent organization and continued on its own as the Women\u0027s Emergency Motor Corps, a vital part of the Tacoma Home Defense Movement. (T.Times 11/19/1940 p.1)"},"color":"rgb(255,161,57)","size":14.166666030883789},{"x":255.0150146484375,"y":-244.80674743652344,"id":"Item# D59963-B, Date: 1951-07, Decade: 1950s, Address:","attributes":{"date":"1951-07","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D59963-B","description":"A studio portrait of an African American man. He is wearing a suit with wide lapels and a fedora with a wide brim. Ordered by C.A. Carter."},"color":"rgb(0,252,186)","size":10.0},{"x":316.6581726074219,"y":-196.86520385742188,"id":"Item# D59963-A, Date: 1951-07, Decade: 1950s, Address:","attributes":{"date":"1951-07","Out-Degree":"0","decade":"1950s","In-Degree":"1","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D59963-A","description":"A studio portrait of an African American woman. She is wearing a dress with half in a dark tone and half in a light tone. Her hair is worn with many waves, pulled back from her face. Ordered by C.A. Carter."},"color":"rgb(0,252,186)","size":10.0},{"x":-14.83769416809082,"y":130.90394592285156,"id":"0","attributes":{"Out-Degree":"0","In-Degree":"0","Modularity Class":"6","Degree":"0"},"color":"rgb(181,215,255)","size":15.0},{"x":-101.32183074951172,"y":-139.9562530517578,"id":"Item# D44621-5, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","attributes":{"date":"8/28/49","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"1723 S I ST, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D44621-5","description":"Bethlehem Baptist Church primarily had African-American members. In January 1959 Bethlehem Baptist Church was destroyed by a fire, the congregation decided to rebuild their facilities. View of banquet celebrating the 10th anniversary of Reverend Edward Byard Wilson; Reverend Wilson (seated on the right next to wife Allie) is joined by family, friends, and other church members.  TPL-8582"},"color":"rgb(0,252,186)","size":10.0},{"x":-14.429457664489746,"y":130.90516662597656,"id":"4","attributes":{"Out-Degree":"11","In-Degree":"0","Modularity Class":"3","Degree":"11"},"color":"rgb(181,215,255)","size":12.5},{"x":10.489404678344727,"y":193.93405151367188,"id":"Item# D730-1, Date: 11-15-1936, Decade: 1930s, Address:","attributes":{"date":"11/15/36","Out-Degree":"0","decade":"1930s","In-Degree":"1","Modularity Class":"2","Degree":"1","subject":"Immigrant Communities","name":"D730-1","description":"The only survivors of the 132 people traveling on an 1853 immigrant train to Puget Sound, Lee H. Baker and George H. Himes.  They are standing in a forested area with a small group of people including W. P. Bonney, far right, and Tacoma Times columnist E.T. Short, rear.   The immigrants came to this area via the Naches Pass and on November 15, 1936, they relived their journey over part of the old trail.  4 and 10 years old respectively when they arrived, Mr. Baker and Mr. Himes shared reminiscences including the wondrous sight of mounds of mashed potatoes to feed the hungry travelers and the importance of resting on the Sabbath which saved wear and tear on both cattle and men.   Mr. Baker, 88, is a retired Portland educator; Mr. Himes, the secretary of the Oregon Historical Society and Mr. Bonney, the secretary of the Washington State Historical Society.  (T.Times, 11-19-36, p. 24)"},"color":"rgb(243,220,22)","size":11.666666984558105},{"x":97.95189666748047,"y":66.67549896240234,"id":"Item# D12799-1, Date: 05-17-1942, Decade: 1940s, Address: 1717 PACIFIC AVE, TACOMA","attributes":{"date":"5/17/42","Out-Degree":"0","decade":"1940s","In-Degree":"1","address":"1717 PACIFIC AVE, TACOMA","Modularity Class":"3","Degree":"1","subject":"Japanese Americans","name":"D12799-1","description":"On May 17, 1942, 418 Tacoma citizens of Japanese ancestry gather at Union Station prior to being shipped to the Pinedale \"Assembly Center,\" an internment camp near Fresno California. Following the Japanese attack on Pearl Harbor on Dec. 7, 1941, President Franklin Delano Roosevelt issued Executive Order 9066 allowing the military to shortcut civil liberties and remove anyone they considered potentially dangerous from any area considered to be at risk. On March 2, 1942, the Western Defense Command unveiled its plan to banish all people of Japanese ancestry from the entire West Coast and incarcerate them in internment camps. (T. Times 5/18/1942, pg. 1; TNT 5/18/2003, pg. B8+ by Stan Flewelling)"},"color":"rgb(255,162,255)","size":12.5},{"x":-97.60916137695312,"y":-47.61622619628906,"id":"Item# D153757-5C, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","attributes":{"date":"12/20/68","Out-Degree":"0","decade":"1960s","In-Degree":"1","address":"773 BROADWAY, TACOMA","Modularity Class":"0","Degree":"1","subject":"African Americans","name":"D153757-5C","description":"Red Rose Cotillion.  30 young debutantes pose under the elaborate chandelier in the Winthrop Hotel\u0027s Crystal Ballroom on December 20, 1968.  They were being introduced to society under the auspices of the Unique Social \u0026 Community Club.  Dressed in white evening gowns and holding bouquets of American Beauty red roses, they smile before the large gathering of proud family and friends.  Names of the 30 young collegians were listed in the News Tribune article dated December 22, 1968.  Betty Brown, daughter of Mr. and Mrs. Willie J. Brown, was chosen queen of the ball.  Photograph ordered by the Unique Social \u0026 Community Club.  (TNT 12-22-68, D-4)"},"color":"rgb(0,252,186)","size":10.0}],"edges":[{"source":"1","target":"Item# D153201-9, Date: 12-23-1967, Decade: 1960s, Address:","id":"4","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D53415-12, Date: 10-14-1950, Decade: 1950s, Address:","id":"20","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D44664-6, Date: 08-25-1949, Decade: 1940s, Address:","id":"32","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D631-2, Date: 12-10-1935, Decade: 1930s, Address:","id":"23","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# A21726-1, Date: 03-22-1946, Decade: 1940s, Address: 737 41 SAINT HELENS AVE, TACOMA","id":"39","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D13060-1, Date: 07-03-1942, Decade: 1940s, Address:","id":"44","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D77667-1, Date: 09-10-1953, Decade: 1950s, Address:","id":"24","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D107454-66, Date: 08-11-1957, Decade: 1950s, Address:","id":"50","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D30536-3, Date: 11-17-1947, Decade: 1940s, Address:","id":"58","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# A109525-6, Date: 10-27-1957, Decade: 1950s, Address: 1901 S FAWCETT AVE, TACOMA","id":"47","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D155757-1, Date: 02-14-1969, Decade: 1960s, Address: 922 MARTIN LUTHER KING JR WAY, TACOMA","id":"9","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D162564-1, Date: 11-09-1972, Decade: 1970s, Address:","id":"14","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D59963-B, Date: 1951-07, Decade: 1950s, Address:","id":"22","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# C87485-22, Date: 03-22-1905, Decade: 1900s, Address: 2120 S C ST, TACOMA","id":"37","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D13064-2, Date: 07-09-1942, Decade: 1940s, Address:","id":"51","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# D14382-3, Date: 04-16-1943, Decade: 1940s, Address: 1347 1/2 BROADWAY, TACOMA","id":"34","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D31335-4, Date: 01-07-1948, Decade: 1940s, Address: 734 PACIFIC AVE, TACOMA","id":"63","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# A8045-2, Date: 04-22-1905, Decade: 1930s, Address: 1902-04 JEFFERSON AVE, TACOMA","id":"40","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D34348-4, Date: 07-20-1948, Decade: 1940s, Address: 719 COMMERCE ST, TACOMA","id":"16","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# A62012-2, Date: 11-05-1951, Decade: 1950s, Address: 5229 SOUTH TACOMA WAY, TACOMA","id":"33","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D12799-1, Date: 05-17-1942, Decade: 1940s, Address: 1717 PACIFIC AVE, TACOMA","id":"49","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D161853-1, Date: 03-31-1972, Decade: 1970s, Address: 2413 E C ST, TACOMA","id":"12","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D10441-3, Date: 11-15-1940, Decade: 1940s, Address:","id":"64","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D91099-1, Date: 06-06-1955, Decade: 1950s, Address:","id":"25","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# A1955-1, Date: 04-10-1905, Decade: 1920s, Address:","id":"42","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D153757-5C, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","id":"7","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D156024-4R, Date: 02-04-1969, Decade: 1960s, Address:","id":"10","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D44621-5, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","id":"18","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D14126-2, Date: 03-02-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","id":"1","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D168561-1, Date: 04-12-1978, Decade: 1970s, Address:","id":"15","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D59963-A, Date: 1951-07, Decade: 1950s, Address:","id":"21","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D153757-5, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","id":"6","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D12299-11, Date: 12-12-1941, Decade: 1940s, Address:","id":"46","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"5","target":"Item# D11917-1, Date: 09-20-1941, Decade: 1940s, Address:","id":"53","attributes":{"subject":"Native Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D137328-3, Date: 01-20-1963, Decade: 1960s, Address: 773 BROADWAY, TACOMA","id":"61","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# 866-2, Date: 1949-07, Decade: 1940s, Address:","id":"45","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# A18416-1, Date: 10-26-1944, Decade: 1940s, Address: 773 BROADWAY, TACOMA","id":"56","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D8869-85, Date: 04-22-1905, Decade: 1930s, Address: 5700 20TH ST E, TACOMA","id":"43","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D10217-14, Date: 09-09-1940, Decade: 1940s, Address: 3572 PACIFIC AVE, TACOMA","id":"31","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D44621-2, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","id":"17","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D12971-3, Date: 06-15-1942, Decade: 1940s, Address:","id":"62","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"5","target":"Item# G5.1-011, Date: 1933-02, Decade: 1930s, Address:","id":"55","attributes":{"subject":"Native Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D30514-3, Date: 11-17-1947, Decade: 1940s, Address: 4360 N VERDE ST, TACOMA","id":"57","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# D28082-3, Date: 05-29-1947, Decade: 1940s, Address: 405 BROADWAY, TACOMA","id":"41","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D153757-5RC, Date: 12-20-1968, Decade: 1960s, Address: 773 BROADWAY, TACOMA","id":"8","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# A12970-2, Date: 06-18-1942, Decade: 1940s, Address: 47 SAINT HELENS AVE, TACOMA","id":"36","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D156033-7, Date: 03-11-1969, Decade: 1960s, Address: 407 14TH AVE SE, PUYALLUP","id":"30","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# A96666-2, Date: 02-19-1956, Decade: 1950s, Address: 1717 FAWCETT AVE, TACOMA","id":"48","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D61698-3, Date: 10-22-1951, Decade: 1950s, Address: 3500 N 18TH ST, TACOMA","id":"60","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"6","target":"Item# D30536-5, Date: 11-17-1947, Decade: 1940s, Address:","id":"59","attributes":{"subject":"Women\u0027s Rights"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D125214-2, Date: 02-04-1960, Decade: 1960s, Address:","id":"27","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D145942-38RC, Date: 10-23-1965, Decade: 1960s, Address: 1411 YAKIMA AVE S, TACOMA","id":"3","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# A8319-3, Date: 06-22-1939, Decade: 1930s, Address:","id":"38","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D153256-8R, Date: 01-09-1968, Decade: 1960s, Address: 1407 S I ST, TACOMA","id":"5","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D9128-1, Date: 1939-11, Decade: 1930s, Address: 530 BROADWAY, TACOMA","id":"26","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"3","target":"Item# D730-1, Date: 11-15-1936, Decade: 1930s, Address:","id":"35","attributes":{"subject":"Immigrant Communities"},"color":"rgb(44,123,182)","size":1.0},{"source":"4","target":"Item# D122125-2, Date: 07-14-1959, Decade: 1950s, Address:","id":"52","attributes":{"subject":"Japanese Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D44621-6, Date: 08-28-1949, Decade: 1940s, Address: 1723 S I ST, TACOMA","id":"19","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D14126-4, Date: 03-02-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","id":"2","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D77145-3, Date: 11-22-1953, Decade: 1950s, Address:","id":"29","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D157803-3, Date: 01-23-1970, Decade: 1970s, Address: 1138 COMMERCE ST, TACOMA","id":"11","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D162110-7, Date: 07-07-1972, Decade: 1970s, Address:","id":"13","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"2","target":"Item# D46376-4, Date: 12-10-1949, Decade: 1940s, Address:","id":"28","attributes":{"subject":"Disabled Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"1","target":"Item# D14126-1, Date: 02-28-1943, Decade: 1940s, Address: 713-15 COMMERCE ST, TACOMA","id":"0","attributes":{"subject":"African Americans"},"color":"rgb(44,123,182)","size":1.0},{"source":"5","target":"Item# W12-1, Date: 07-31-1936, Decade: 1930s, Address: 1406 54TH AVE E, FIFE","id":"54","attributes":{"subject":"Native Americans"},"color":"rgb(44,123,182)","size":1.0}]}